Catalogs/ТарифыПлатежныхАгентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ТарифыПлатежныхАгентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяШкала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаСуммы</Name>
					<Comment>Способ ввода суммы по тарифу. 0 — процент взимается с полной суммы перевода, 1 — процент взимается с суммы перевода, превышающей предыдущий порог</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Шкала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Порог</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальнаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальнаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТарифыПлатежныхАгентов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область БлокФункцийПервоначальногоЗаполненияИОбновленияИБ

Процедура СоздатьТарифыПоНастройкам(НастройкиРасчетаЗарплаты = Неопределено) Экспорт
	
	Если НастройкиРасчетаЗарплаты = Неопределено Тогда
		НастройкиРасчетаЗарплаты = РасчетЗарплатыРасширенный.НастройкиРасчетаЗарплаты();
	КонецЕсли;
	
	// Исполнительные документы
	Если Не НастройкиРасчетаЗарплаты.ИспользоватьИсполнительныеЛисты Тогда
		Возврат;
	КонецЕсли;
	
	// 4D:ERP для Беларуси, Петр, 27.11.2017 17:21:59 
	// Редактировать начальное заполнение спр. "Тарифы платежных агентов", №16849
	// {
	// Белпочта
	Тариф = Справочники.ТарифыПлатежныхАгентов.СоздатьЭлемент();
	Тариф.Наименование = НСтр("ru = 'Белпочта'");
	
	Тариф.ИспользуетсяШкала = Истина;
	
	СтрокаШкалы = Тариф.Шкала.Добавить();
	СтрокаШкалы.Порог = 33.33;
	СтрокаШкалы.Сумма = 1;
	
	СтрокаШкалы = Тариф.Шкала.Добавить();
	СтрокаШкалы.Порог = 100;
	СтрокаШкалы.Процент = 3;
	
	СтрокаШкалы = Тариф.Шкала.Добавить();
	СтрокаШкалы.Порог = 300;
	СтрокаШкалы.Процент = 2;
	
	СтрокаШкалы = Тариф.Шкала.Добавить();
	СтрокаШкалы.Порог = 500;
	СтрокаШкалы.Процент = 1;
	
	СтрокаШкалы = Тариф.Шкала.Добавить();
	СтрокаШкалы.Процент = 0.5;
	
	Тариф.Записать();
	// }
	// 4D
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
